["DHYANESHVAR K\nAIML Enthusiast\nPhone: 8825507978 Address: Koundampalayam, Coimbatore, TamilNadu\nEmail: dhyaneshvark1805@gmail.com Portfolio: https://dhyanesh18.github.io/Portfolio-Website/\nLinkedIn: https://www.linkedin.com/in/dhyaneshvar-k GitHub: https://github.com/Dhyanesh18\nABOUT\nI am a second-year BTech student in Computer Science at IIITS, with a strong proficiency in Python and its libraries for\ndata analysis, machine learning, and deep learning. Passionate about Artificial Intelligence, I focus primarily on Natural\nLanguage Processing (NLP), Large Language Models (LLMs), and Speech Processing. Currently, I am expanding my\nexpertise in LLMs and enhancing my skills in web development, model integration with applications, and model\ndeployment. EDUCATION\nIndian Institute of Information Technology Sri City | 2023-2027 SSVM WORLD SCHOOL | 2022\nB.Tech in Computer Science Grade 12th CBSE\nGPA: 8.81 Grade: 90.4%\nPROJECTS\nAGRIINTEL - A Smart AI Platform to help Indian farmers February 2025\nA project made during the AGRIAI hackathon in IIITS, by a team of 3\nContributions: Crop recommendation using Random Forest with 96+% accuracy along\nwith recommender system that uses crop yield data, MSP data and rainfall and other\nweather data combined with Soil nutrient data to give profitable predictions\nRecommender to suggest steps to take based on current crop and soil conditions. General RAG Chatbot with Hybrid Retrieval and HyDE and local LLM May 2025\nA Local RAG setup which uses Hybrid Retrieval (BM25 + Dense) with RRF.", "HyDE in parallel using asyncio and Cross Encoder for reranking. FastAPI backend with HTML\nEvaluated and compared on the BEIR scifact dataset, for different pipeline setups. Scores: NDCG@5: 0.66 MAP@5: 0.63 Recall@5: 0.74 Precision@1: 0.58\nJARVIS like Personal assistant with a local LLM December 2024\nA Jarvis like personal assistant for laptop using llama-cpp with CUDA\nPyQt library for UI, Vosk for voice input, pyttsx for speech output for various tasks\nUsed a Text Classifier initially for intent classification, later added Llama-3.1-8B_q4_k_m\nEfficiently stores and retrieves session summaries in ChromaDB for retrieval as context\nBanglore housing price prediction December 2023\nUsed GridSearchCV for best model on the given dataset. Basic EDA, trained a Linear\nRegression model with 93% accuracy. Flask for Backend.", "HTML, CSS and JS for Frontend. Used Docker for containerization and deployed in Render\nSKILLLS\nCLUBS\nMachine Learning Pandas Seaborn\nDeep Learning Numpy Docker Google Developer Groups IIITS\nNLP Matplotlib HTML AIML Core member\nExploratory Data Analysis Tensorflow CSS\nPython FastAPI JavaScript NexSync Club IIITS\nMySQL PyTorch AIML Domain member\nLANGUAGES ENGLISH TAMIL HINDI\nCERTIFICATES PSupervised Machine Learning: Unsupervised Learning, Recommenders,\nRegression and Classification | 2024 Reinforcement Learning | 2025\nDeepLearning.AI, Coursera DeepLearning.AI, Coursera"]